xdu-aero-association/FM33LC0XX_Example_0.04/ATIM 输入捕获/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_flash.h
/**
  * @brief    
  * @rmtoll   ISR    KEYSTA    LL_FLASH_GetFlashLockStatus
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_FLASH_FLASH_KEY_STATUS_LOCK
  *           @arg @ref LL_FLASH_FLASH_KEY_STATUS_CHIP_ERASE
  *           @arg @ref LL_FLASH_FLASH_KEY_STATUS_SECTOR_ERASE
  *           @arg @ref LL_FLASH_FLASH_KEY_STATUS_PROGRAM
  *           @arg @ref LL_FLASH_FLASH_KEY_STATUS_ERROR
  */
__STATIC_INLINE uint32_t LL_FLASH_GetFlashLockStatus(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_KEYSTA_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    BTSTA    LL_FLASH_GetFlashSwapStatus
  * @param    FLASHx FLASH instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_FLASH_BOOT_FLASH_SECTOR_0000H_1FFFH
  *           @arg @ref LL_FLASH_BOOT_FLASH_SECTOR_2000H_3FFFH
  */
__STATIC_INLINE uint32_t LL_FLASH_GetFlashSwapStatus(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_BTSTA_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    OPTERR    LL_FLASH_IsActiveFlag_OPTProGramError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_OPTProGramError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_OPTERR_Msk) == (FLASH_ISR_OPTERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    OPTERR    LL_FLASH_ClearFlag_OPTProGramError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_OPTProGramError(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->ISR, FLASH_ISR_OPTERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    AUTHERR    LL_FLASH_IsActiveFlag_AuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_AuthenticationError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_AUTHERR_Msk) == (FLASH_ISR_AUTHERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    AUTHERR    LL_FLASH_ClearFlag_AuthenticationError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_AuthenticationError(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->ISR, FLASH_ISR_AUTHERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    KEYERR    LL_FLASH_IsActiveFlag_KEYError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_KEYError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_KEYERR_Msk) == (FLASH_ISR_KEYERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    KEYERR    LL_FLASH_ClearFlag_KEYError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_KEYError(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->ISR, FLASH_ISR_KEYERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    CKERR    LL_FLASH_IsActiveFlag_ClockError
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_ClockError(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_CKERR_Msk) == (FLASH_ISR_CKERR_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    CKERR    LL_FLASH_ClearFlag_ClockError
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_ClockError(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->ISR, FLASH_ISR_CKERR_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    PRD    LL_FLASH_IsActiveFlag_ProgramFinish
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_ProgramFinish(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_PRD_Msk) == (FLASH_ISR_PRD_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    PRD    LL_FLASH_ClearFlag_ProgramFinish
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_ProgramFinish(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->ISR, FLASH_ISR_PRD_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    ERD    LL_FLASH_IsActiveFlag_EraseFinish
  * @param    FLASHx FLASH instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsActiveFlag_EraseFinish(FLASH_Type* FLASHx)
{
    return (uint32_t)(READ_BIT(FLASHx->ISR, FLASH_ISR_ERD_Msk) == (FLASH_ISR_ERD_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    ERD    LL_FLASH_ClearFlag_EraseFinish
  * @param    FLASHx FLASH instance
  * @retval   None
  */
__STATIC_INLINE void LL_FLASH_ClearFlag_EraseFinish(FLASH_Type* FLASHx)
{
    WRITE_REG(FLASHx->ISR, FLASH_ISR_ERD_Msk);
}

/**
  * @}
  */

/** @defgroup FLASH_LL_EF_Init Initialization and de-initialization functions
  * @{
  */

ErrorStatus LL_FLASH_PageErase(FLASH_Type* FLASHx, uint32_t Address);
ErrorStatus LL_FLASH_SectorErase(FLASH_Type* FLASHx, uint32_t Address);
ErrorStatus LL_FLASH_Program_Word(FLASH_Type* FLASHx, uint32_t Address, uint32_t data );
ErrorStatus LL_FLASH_Program_Page(FLASH_Type* FLASHx, uint32_t PageNum, uint32_t *data);
ErrorStatus LL_FLASH_Program_Sector(FLASH_Type* FLASHx, uint32_t SectorNum, uint32_t *data);
/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_FLASH_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-09-23**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
